# SpotSlopeSlopeDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotSlopeSlopeDirection Property
ParameterTypeId Class See Also
---
"Slope Direction"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotSlopeSlopeDirection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotSlopeSlopeDirection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotSlopeSlopeDirection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace